 <%@page pageEncoding="UTF-8" contentType="text/html; charset=UTF-8"%>
     <%@ page isELIgnored = "false" %>
  <%@ taglib uri="http://java.sun.com/jsp/jstl/core" prefix="c" %>
  <%@ page import="java.io.*,java.util.*,java.sql.*"%>
  <%@ page import="javax.servlet.http.*,javax.servlet.*" %>
<html>
<head>
		<title> Moria </title>
		<meta charset="utf-8">
		<link rel="stylesheet" type="text/css" href="style.css">
	</head>
<body>

		<h1 class="myGrey" id="about"> Исстория Кхазад-Дум</h1>

<a href="http://www.google.ru/search?q=Кхазад-Дум" title="Поиск" target="__blank">Узнать подробнее</a>

		<h2 class="myGrey">Оглавление</h2>
		<ul>
			<li ><a class="myGrey" href="#1">Мория</a></li>
			<li class="myGrey"><a href="#2">Географическое положение</a></li>
			<li class="myGrey"><a href="#3">История основания</a></li>
			<li class="myGrey"><a href="#4">Падение Кхазад-Дума</a></li>
			<li class="myGrey"><a href="#5">Мория после Битвы Пяти воинств</a></li>
			<li class="myGrey"><a href="#Dwarf">Первые правители Гномов</a></li>
		</ul>

		<h2 class="myGrey" id="1">Мория</h2>

		<p>Мория (синд. Moria, «чёрная бездна»; также Кхазад-Дум, Дварроуделф, Хадходронд и Фурунаргиан) — в легендариуме Дж. Р. Р. Толкина огромный подземный город-государство в Мглистых горах Средиземья. Её обширная сеть туннелей включала глубокие шахты и огромные залы, соединённые переходами. В течение многих тысяч лет обитателями Мории являлись гномы-наугрим из династии Дурина (англ. Durin).</p>

		<img src="images/Мория.jpg" height="200px" width="200px">

		<h2 class="myGrey" id="2">Географическое положение</h2>

		<p>Наибольшая часть залов, переходов и шахт Мории географически располагалась примерно в центре Мглистых Гор, под системой из трёх горных вершин — Баразинбара (синд. Карадрас), Зирак-зигиля (синд. Келебдил) и Бундушатхура (синд. Фануидол), через которые пролегал перевал, известный как Багровые Ворота.</p>

<p>У подножия Карадраса находились Западные Врата Кхазад-Дума, выполненные гномами и зачарованные мастерами из эльфов-нолдор Гвайт-и-Мирдайн, которые во Вторую Эпоху основали своё королевство в Эрегионе. С другой стороны горного хребта открывались Восточные Врата, выходившие в долину Нандухирион (или Азанулбизар на языке гномов).</p>

<img src="images/География.jpg" height="300px" width="450px">

<h2 class="myGrey" id="3">История основания</h2>

<p>Этот город-государство был основан Дурином Первым Бессмертным ещё в бессолнечную Эпоху Деревьев, за несколько тысяч лет до Пробуждения Людей. Изначально Дурин Первый жил под горой Гундабад на севере Мглистых гор. Путешествуя на юг, он достиг высокогорного озера, где увидел отражение звёзд в воде в виде короны, сверкающей над его головой. Приняв это как благоприятное знамение, Дурин впоследствии сделал это место своим новым домом. Он назвал это озеро Зеркальным или Келед Зарам, и оно оставалось почитаемым местом среди гномов — обитателей города, который он назвал Кхазад-Дум, ставший известным позже как Мория.</p>

<p>В Мории Дурин основал клан Длиннобородых — самый древний из семи кланов гномов, став королём Кхазад-Дума. Впоследствии шестерым из его потомков и наследников давали его имя, поскольку они были очень похожи на своего праотца. Их считали перевоплощениями Дурина Бессмертного.</p>

<p>В начале Второй Эпохи в Морию переселилось множество гномов из разрушенных в ходе Войны Гнева западных гномьих городов Ногрода и Белегоста, располагавшихся в западной части горного хребта Эред Луин.<br> Гномы Кхазад-Дума тогда торговали, чтобы поддерживать дружбу с царством эльфов-нолдор Эрегионом, но эта дружба прекратилась после создания Сауроном Кольца Всевластья и разрушения эльфийского царства. Врата Кхазад-Дума были надолго закрыты, и Саурон так и не смог войти в это место.</p>

<img src="images/История основания.jpg" height="300px" width="500px">

<h2 class="myGrey" id="4">Падение Кхазад-Дума</h2>

<p>Главное богатство Мории состояло не в железе, серебре или золоте, а в драгоценном металле — мифриле, который был найден только здесь. В 1980 году Третьей Эпохи гномы, исчерпав более доступные мифриловые жилы, ушли на самые глубинные горизонты и невольно пробудили балрога, которого они назвали Погибелью Дурина, поскольку он убил короля Дурина VI в том же году и в следующем году — Наина Первого, его сына. Гномы оказались бессильными перед Погибелью Дурина и потому были вынуждены бежать из Кхазад-Дума. После этого Кхазад-Дум стал местом страха и зла, и именно тогда эльфы назвали его Мория (Чёрная Бездна).</p>

<p>Некоторое время спустя орки Мглистых Гор сделали Морию своим обиталищем, но в 2790 году Т. Э. бывший Король-Под-Горой Трор, потомок Дурина Бессмертного, опрометчиво попытался повторно занять свой наследственный дом. Он был убит предводителем местных гоблинов Азогом, и это убийство развязало войну гномов и орков, которая завершилась кровавым сражением в Азанулбизаре за восточными вратами Мории девять лет спустя. Гномы победили, но они понесли большие потери и не стали занимать Морию, не желая встречаться с Погибелью Дурина.</p>

<p>Несколько поколений позже Балин, который сопровождал хоббита Бильбо Бэггинса во время его знаменитого путешествия в Эребор, описанного в «Хоббите, или Туда и обратно», собрал новую группу гномов, чтобы снова попытаться восстановить древний город. Первоначально удача сопутствовала ему, но через несколько лет группа Балина была уничтожена орками и Погибелью Дурина; об их судьбе узнали лишь многие годы спустя.</p>

<img src="images/падение Кхазад дума.jpg" height="300px" width="300px">

<h2 class="myGrey" id="5">Мория после Битвы Пяти воинств</h2>

<p>После восшествия на престол Даина II в Эреборе, родился Дурин VII прямой наследник Торина III Камнешлема (как говорилось в пророчестве). Он был последним потомком Дурина и возглавлял Народ Дурина во время повторной попытки вернуть Кхазад-Дум, через некоторое (неуточнённое) время, после начала Четвёртой Эпохи, где они и остались «пока мир не состарился, и гномы не исчезли, и дни народа Дурина не окончились».</p>

<img src="images/При битве 5 воинств.jpg" height="300px" width="500px">
<br>

<a href="#about">Назад</a>

<hr>
<h2 class="myGrey" id="Dwarf">Перечень первых правителей Кхазад-дума</h2>

		<br>

<c:forEach items="${allPerson}" var="name" >
        <c:out value="${name.name}"/>&nbsp; Возраст -
        <c:out value="${name.age }"/>&nbsp; Королевство -
        <c:out value="${name.city }"/><p>
     </c:forEach>

<br>
</body>
</html>


